#include <stdlib.h>
#include <unistd.h>
#include <fcntl.h>

int			get_size(char *s, int *fd, int *size)
{
	char	buf[1024];
	int		l_nl[2] = {0, 0};
	int		ret;
	int		i;

	if (!s || (*fd = open(s, O_RDONLY)) < 0)
		return (0);
	while ((ret = read(*fd, buf, 1024)))
	{
		i = -1;
		while (++i < ret)
		{
			if (buf[i] == '\n')
			{
				if ((l_nl[0] != 0 && (i - l_nl[1]) % l_nl[0] != 0) || i > 1024)
					return (0);
				l_nl[0] = l_nl[0] ? i / (l_nl[1] + 1) : i;
				l_nl[1]++;
			}
		}
		*size += ret;
	}
	close(*fd);
	return (l_nl[0]);
}

void		find_island(char *map, int index, int s_sl[2], char *nbr)
{
	if (index > s_sl[0])
		return ;
	if (map[index] == 'X')
	{
		map[index] = *nbr;
		find_island(map, index + 1, s_sl, nbr);
		find_island(map, index + s_sl[1] + 1, s_sl, nbr);
		find_island(map, index - 1, s_sl, nbr);
		find_island(map, index - s_sl[1] - 1, s_sl, nbr);
	}
}

void		print_island(char *map, int size_line, int size)
{
	int		s_sl[2];
	int		i;
	char	nbr;

	nbr = '0';
	i = -1;
	s_sl[0] = size;
	s_sl[1] = size_line;
	while (++i < size)
	{
		if (map[i] == 'X')
		{
			find_island(map, i, s_sl, &nbr);
			nbr = nbr + 1;
		}
	}
	i = -1;
	write(1, map, size);
	if (map)
		free(map);
}

int			count_island(char *s)
{
	char	*map;
	int		size;
	int		fd;
	int		size_line;

	size = 0;
	if ((size_line = get_size(s, &fd, &size)) == 0)
		return (0);
	if (!size)
		return (0);
	if ((fd = open(s, O_RDONLY)) < 0)
		return (0);
	if (!(map = (char *)malloc(sizeof(char) * (size + 1))))
		return (0);
	map[size] = '\0';
	if ((read(fd, map, size)) < 0)
		return (0);
	print_island(map, size_line, size);
	close(fd);
	return (1);
}

int			main(int argc, char ** argv)
{
	if (argc == 2)
	{
		if (count_island(argv[1]) == 0)
			write(1, "\n", 1);
	}
	else
		write(1, "\n", 1);
		return (0);
}

/*
Assignment name  : count_island
Expected files   : *.c, *.h
Allowed functions: open, close, read, write, malloc, free
--------------------------------------------------------------------------------
같은 길이의 줄을 포함하는 파일을 가져오는 프로그램을 작성한다. 이러한 행에는 '.' 또는 'X' 문자가 포함되어 있습니다. 이 모든 선들은 'X'의 섬들을 포함하는 '.'의 직사각형들을 형성한다.
줄의 최대 크기는 끝의 새 줄을 포함하여 1024자입니다.
각 행의 시작과 동일한 개수의 문자로 구분된 파일의 문자 집합으로 구성된 열입니다.
두 문자가 연속적이고 같은 선상에 있거나, 연속된 선과 같은 열에 있는 경우 두 문자가 접촉한다고 합니다.
'X'의 "섬"은 서로 접촉하는 'X'의 집합을 의미한다.
이 프로그램은 파일을 통과해야 하며 파일의 시작부터 파일에 나타나는 위치에 해당하는 숫자로 모든 'X'를 바꾼 후 표시해야 한다.
결과는 하나만 있을 수 있습니다.
파일이 비어 있거나 오류(예: 일관되지 않은 입력)가 있거나 매개 변수가 전달되지 않은 경우 프로그램은 새 줄을 표시해야 합니다.
파일에는 최대 10개의 섬이 포함되어 있습니다.
제목 디렉터리에서 예제를 찾을 수 있습니다.
Examples:
$>cat toto
.................XXXXXXXX..........................................
....................XXXXXXXXX.......XXXXXXXX.......................
.................XXXXXXXX..............XXX...XXXXX.................
.....................XXXXXX.....X...XXXXXXXXXXX....................
................................X..................................
......XXXXXXXXXXXXX.............X..................................
..................X.............XXXXXXXXX..........................
..................X.........XXXXXXXXXXXX...........................
..................X................................................
XX.............................................................XXXX
XX..................XXXXXXXXXXXXX.................................X
...................................................................
.................................................................X.
.....................XXXXX.......................................XX
$>
$>./count_island toto
.................00000000..........................................
....................000000000.......11111111.......................
.................00000000..............111...11111.................
.....................000000.....2...11111111111....................
................................2..................................
......3333333333333.............2..................................
..................3.............222222222..........................
..................3.........222222222222...........................
..................3................................................
44.............................................................5555
44..................6666666666666.................................5
...................................................................
.................................................................7.
.....................88888.......................................77
$>
$>cat qui_est_la
...................................................................
...X........X.....XXXXX......XXXXXXX...XXXXXXXXXX..XXXXXXXXXX......
...XX......XX....XX...XX....XX.....XX.....XXXX.....XXXXXXXXXX......
...XXXX..XXXX...XX.....XX...XX.....XX......XX......XX..............
...XX.XXXX.XX...XX.....XX...XX.....XX......XX......XX..............
...XX...X..XX...XX.....XX...XXXXXXXX.......XX......XXXXX...........
...XX......XX...XXXXXXXXX...XXXX...........XX......XXXXX...........
...XX......XX..XX.......XX..XX.XX..........XX......XX..............
...XX......XX..XX.......XX..XX...X.........XX......XX..............
...XX......XX..XX.......XX..XX....X......XXXXXX....XXXXXXXXXX......
...XX......XX.XX.........XX.XX.....XX..XXXXXXXXXX..XXXXXXXXXX..X...
...................................................................
$>
$>./count_island qui_est_la
...................................................................
...0........0.....11111......2222222...3333333333..4444444444......
...00......00....11...11....22.....22.....3333.....4444444444......
...0000..0000...11.....11...22.....22......33......44..............
...00.0000.00...11.....11...22.....22......33......44..............
...00...0..00...11.....11...22222222.......33......44444...........
...00......00...111111111...2222...........33......44444...........
...00......00..11.......11..22.22..........33......44..............
...00......00..11.......11..22...5.........33......44..............
...00......00..11.......11..22....6......333333....4444444444......
...00......00.11.........11.22.....77..3333333333..4444444444..8...
...................................................................
$>
$>cat -e rien
$>./count_island rien | cat -e
$
$>


*/
